using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace newQuiz
{
	internal class QuestionAstronomyClass
	{
		public List<string> QuestionAstronomy()
		{
			return new List<string>
			{
				"Яка планета є найбільшою у Сонячній системі?\nA) Марс\nB) Юпітер\nC) Земля",
				"Яка планета є найменшою у Сонячній системі?\nA) Венера\nB) Меркурій\nC) Марс",
				"Яке явище відбувається, коли Місяць перекриває Сонце, що викликає затемнення?\nA) Сонячне затемнення\nB) Місячне затемнення\nC) Сонячна корон",
				"Яке небесне тіло вважається «найближчим до Сонця»?\nA) Місяць\nB) Венера\nC) Меркурій",
				"Яка галактика є найближчою до нашої Галактики Молочного Шляху?\nA) Андромеда\nB) Трійкутник\nC) Баранець",
				"Яке явище відбувається, коли зоря масивно вибухає та стає надлишково яскравою?\nA) Затемнення\nB) Зоряний вибух\nC) Перетворення",
				"Який зоряний сукупник є найбільшим у нашій Галактиці?\nA) Млечний Шлях\nB) Оріоновий Туман\nC) Ядро Галактики",
				"Яка планета має найбільше кількість супутників в Сонячній системі?\nA) Юпітер\nB) Сатурн\nC) Земля",
				"Яка планета має найбільший період обертання навколо Сонця?\nA) Марс\nB) Уран\nC) Земля",
				"Яка планета має найменший період обертання навколо Сонця?\nA) Меркурій\nB) Венера\nC) Юпітер",
				"Який об'єкт в Сонячній системі має найбільший об'єм?\nA) Юпітер\nB) Сонце\nC) Земля",
				"Який об'єкт у Всесвіті має найбільшу відому масу?\nA) Сонце\nB) Чорна діра\nC) Юпітер",
				"Який об'єкт у Всесвіті має найбільшу температуру на поверхні?\nA) Зірка\nB) Вогонь\nC) Карликова планета",
				"Що викликає мерехтіння зірок на небосхилі?\nA) Зіткнення з космічними об'єктами\nB) Рухи в атмосфері планети\nC) Інтерференція світла",
				"Яке явище створює враження, що Сонце зникає у воді?\nA) Затемнення\nB) Дифракція\nC) Відбиття",
				"Що таке комета?\nA) Супутник, що обертається навколо планети\nB) Маленька планета у Сонячній системі\nC) Об'єкт, що складається з криги та пилу",
				"Що таке метеорит?\nA) Маленька планета у Сонячній системі\nB) Супутник, що обертається навколо планети\nC) Космічний об'єкт, що потрапив на поверхню планети",
				"Яка найбільша планета у нашій Сонячній системі?\nA) Марс\nB) Юпітер\nC) Земля",
				"Як називається явище, коли Сонце знаходиться між Землею та Місяцем, що призводить до затемнення Місяця?\nA) Сонячне затемнення\nB) Місячне затемнення\nC) Лунатична екліптика",
				"Яка планета має найбільші кільця в Сонячній системі?\nA) Меркурій\nB) Сатурн\nC) Уран"
			};
		}
	}
}
