using newQuiz.Models;
using System;
using System.Collections.Generic;
using System.Globalization;
using System.Linq;
using System.Text;
using System.Threading;
using System.Threading.Tasks;

namespace newQuiz
{
	internal class QuestionBiologyClass
	{
		public List<string> QuestionBiology()
		{
			return new List<string>
			{
			   "Який процес називають фотосинтезом?\nA) Розщеплення молекул глюкози\nB) Перетворення світлової енергії на хімічну\nC) Виділення кисню під час дихання рослин",
					"Яка з цих клітин є основною структурною одиницею нервової системи?\nA) Еритроцит\nB) Нейрон\nC) Лейкоцит",
					"Яка молекула є носієм генетичної інформації в клітинах?\nA) ДНК\nB) РНК\nC) Білок",
					"Як називається процес поділу клітини, під час якого утворюються дві дочірні клітини?\nA) Мейоз\nB) Мітоз\nC) Запліднення",
					"Який орган людини відповідає за фільтрацію крові і утворення сечі?\nA) Печінка\nB) Серце\nC) Нирки",
					"Яка з перелічених структур є найдрібнішою частинкою живого організму?\nA) Клітина\nB) Тканина\nC) Орган",
					"Який гормон виробляється підшлунковою залозою для регуляції рівня цукру в крові?\nA) Глюкагон\nB) Інсулін\nC) Адреналін",
					"Який орган є основним місцем газообміну в організмі людини?\nA) Шлунок\nB) Легені\nC) Печінка",
					"Яка з перелічених тканин утворює скелет людини?\nA) М'язова тканина\nB) Нервова тканина\nC) Кісткова тканина",
					"Який вид кровообігу забезпечує кровообіг у серці?\nA) Лімфатичний\nB) Малий\nC) Великий",
					"Яка структура в клітині відповідає за синтез білків?\nA) Лізосома\nB) Рибосома\nC) Мітохондрія",
					"Який тип симбіозу передбачає взаємну користь для обох організмів?\nA) Паразитизм\nB) Комменсалізм\nC) Мутуалізм",
					"Який елемент найчастіше зустрічається в живих організмах?\nA) Вуглець\nB) Натрій\nC) Кальцій",
					"Яка структура відповідає за рух клітини у рідкому середовищі?\nA) Джгутик\nB) Псевдоподія\nC) Цитоплазма",
					"Який процес забезпечує перенесення генетичної інформації з ДНК на РНК?\nA) Трансляція\nB) Транскрипція\nC) Реплікація",
					"Яка молекула є основним енергетичним носієм у клітинах?\nA) АТФ\nB) Глюкоза\nC) Крохмаль",
					"Який орган відповідає за виробництво інсуліну в організмі людини?\nA) Підшлункова залоза\nB) Щитовидна залоза\nC) Гіпофіз",
					"Який тип тканини здатний до скорочення і відповідає за рух?\nA) Епітеліальна тканина\nB) Нервова тканина\nC) М'язова тканина",
					"Який з процесів не є формою безстатевого розмноження?\nA) Поділ навпіл\nB) Брунькування\nC) Запліднення",
					"Яка структура є місцем фотосинтезу у рослинах?\nA) Мітохондрія\nB) Хлоропласт\nC) Вакуоль"
			};

		}

	}
}
